16-logs-profiling-debug/artillery/artillery-con-log.txt
Phase started: unnamed (index: 0, duration: 1s) 17:56:30(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 17:56:31(-0300)

--------------------------------------
Metrics for period to: 17:56:40(-0300) (width: 8.123s)
--------------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 124/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 28
  max: ......................................................................... 698
  median: ...................................................................... 361.5
  p95: ......................................................................... 459.5
  p99: ......................................................................... 487.9
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 5841.6
  max: ......................................................................... 7309.4
  median: ...................................................................... 7117
  p95: ......................................................................... 7260.8
  p99: ......................................................................... 7260.8


All VUs finished. Total time: 10 seconds

--------------------------------
Summary report @ 17:56:39(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 124/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 28
  max: ......................................................................... 698
  median: ...................................................................... 361.5
  p95: ......................................................................... 459.5
  p99: ......................................................................... 487.9
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 5841.6
  max: ......................................................................... 7309.4
  median: ...................................................................... 7117
  p95: ......................................................................... 7260.8
  p99: ......................................................................... 7260.8