16-logs-profiling-debug/artillery/artillery-sin-log.txt
Phase started: unnamed (index: 0, duration: 1s) 17:58:26(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 17:58:27(-0300)

--------------------------------------
Metrics for period to: 17:58:30(-0300) (width: 1.395s)
--------------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 730/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 64
  median: ...................................................................... 22
  p95: ......................................................................... 37.7
  p99: ......................................................................... 45.2
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 403
  max: ......................................................................... 673.8
  median: ...................................................................... 561.2
  p95: ......................................................................... 658.6
  p99: ......................................................................... 671.9


All VUs finished. Total time: 3 seconds

--------------------------------
Summary report @ 17:58:28(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 730/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 64
  median: ...................................................................... 22
  p95: ......................................................................... 37.7
  p99: ......................................................................... 45.2
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 403
  max: ......................................................................... 673.8
  median: ...................................................................... 561.2
  p95: ......................................................................... 658.6
  p99: ......................................................................... 671.9